-- 此处为nLog功能实现操作
nLog = require('nLog')()
require('xxtsp')


台 = {{
	{262, 342, 0xfedcb8},
	{251, 353, 0xfff7ee},
	{254, 373, 0xfdc890},
	{276, 373, 0xfbac59},
	{279, 356, 0xfee0c0},
	{213, 332, 0xf04c2d},
	{163, 309, 0xfa9d3b},
}, 85, 81, 132, 593, 1021}

房 = {{
	{263, 552, 0xfcc489},
	{253, 555, 0xfff6ec},
	{249, 581, 0xfdd5ab},
	{275, 582, 0xfdce9d},
	{277, 555, 0xffffff},
	{169, 537, 0xf04c2d},
	{145, 517, 0xfa9d3b},
	{445, 617, 0xfa9d3b},
}, 85, 81, 132, 593, 1021}

t = {{
	{251, 247, 0xfba346},
	{254, 247, 0xfcc488},
	{252, 267, 0xfeead5},
	{258, 268, 0xfee4c9},
	{258, 270, 0xfa9d3b},
}, 85, 81, 132, 593, 1021}

T = {{
	{249, 456, 0xfdc68d},
	{257, 479, 0xfee4c9},
	{260, 479, 0xfcb76f},
	{267, 458, 0xfee4c9},
}, 85, 81, 132, 593, 1021}
太 = {{
	{264, 662, 0xfedcb9},
	{250, 669, 0xfdd0a0},
	{249, 691, 0xfdd1a2},
	{266, 690, 0xfcc489},
	{280, 691, 0xfdce9d},
}, 85, 81, 132, 593, 1021}
泰 = {{
	{266, 872, 0xfdca94},
	{252, 874, 0xfcc489},
	{250, 892, 0xfee7cf},
	{252, 900, 0xfdd2a4},
	{277, 874, 0xfcc489},
}, 85, 81, 132, 593, 1021}

开红包 = {{
	{324, 808, 0x3b3b3b},
	{296, 780, 0x3b3b3b},
	{304, 738, 0xebcd9a},
	{373, 836, 0xebcd9a},
	{226, 698, 0xf45e4c},
	{414, 921, 0xf35543},
}, 85, 118, 645, 528, 1077}
返回 = {{
	{ 36, 83, 0xffe2b1},
	{ 54, 82, 0xf35543},
	{482, 80, 0xffe2b1},
	{556, 83, 0xffe2b1},
	{564, 84, 0xf35543},
}, 85, 28, 52, 620, 116}



while true do
	if d(台,'台',true) then
	elseif d(开红包,'开红包',true) then
	elseif d(返回,'返回',true) then
	elseif d(t,'t',true) then
	elseif d(T,'T',true) then
	elseif d(太,'太',true) then
	elseif d(泰,'泰',true) then
	elseif d(房,'房',true) then

	
	end
end	