--随机语言
function random_yuyan()
	local yuyan = {
	
"碰到一个认识的人，想一起聊聊天。她说自己去香港和希腊玩了，又买了苹果和化妆品；我不知道怎么回应，因为我很久没有出去玩和买东西了。我又说我最近思考了人为什么活着和出身的问题，她也沉默，因为很久没有思考这样的问题。此后再也无话。",

" 认真了，却伤了……上线了，却没聊天……隐身了，却没下线……难过了，却没流泪……时间长了，感情淡了……",

" 朋友在qq上聊天：“人生有很多事是无法控制的。”“比如说呢？”“找找呀找呀找朋友，找到一个好朋友，敬个礼，握握手，你是我的好朋友。”“什么意思？”“你能控制住自己在读这段歌词的时候不在心里把它唱出来吗？”",

 "每次和你聊天，只能说说笑笑，不敢逾越朋友的底线，怕说了也会连朋友也做不成，原本以为我们只是聊聊天而已，却想不到我竟然会喜欢上你，没有结局，我也不想拥有，只是在说说笑笑时难免会难受，没有提醒，我也不曾知晓，只是言语之间难免会黯淡。",

"偶尔看回我们几百页的聊天记录，才发现和你居然聊了那么多，偶尔想起我们发生的事情，才发现和你经历了那么多，可是我们由于很多始终不能在一起，偶尔想起会很痛，很遗憾，但足以回味，祝你幸福。",

"真正的放下大概是：你不会删除他的聊天记录，也不会把他拉入黑名单，只是任由他躺在通讯录里，再也懒得去点开。他像你掉进床底的笔，扔在地铁站的水，决定不要了，就再不会想起。他留下的那些痕迹就像家中沙发缝的灰，油烟机上的渍，你不会为它特意来次大扫除，只是心情好时，顺手一擦。",

"男友他们几个人聊天，一个说，老李这人坏是不坏，就是办事鲁莽，动不动就发火。这话刚好被路过的老李听到，他一脚把门踢开，揪着说他的那个人就打，嘴里还骂道：“我啥时侯办事鲁莽了，我啥时侯发过火了。你给我说清楚。”",

"当我们在专心做事的时候，例如工作、运动、聊天，我们感受不到。当脑袋空下来的时候，我们会有两种思想一是回忆，二是想像。近日回想了许多，发现自己就是一个怪物。当安静的时候就想着喧哗，喧哗的时候却嫌它太杂。",

"如果你发现一个常跟你聊天逗乐的人，突然间安静了下来，不再跟你联系，那就不要再去打搅他了，也不必去问为什么。不联系你，不一定是你做错了什么，有可能他只是需要空间，暂时的逃避一下周围的人而已。毕竟每个人每个月都有那么几天不想搭理全世界。",

"一到半夜就翻来覆去的聊天刷屏，只有上课时才会觉得困。家里做好饭喊了半天你也不肯从电脑前起身，偏在深夜看着美食图片饿得流口水。遇到喜欢自己的人就不以为然，非要自己也遭遇爱而不得才懂前者的辛苦。太多的错过都是因为不珍惜，不被珍惜也只能错过。",

"删掉的人可能曾经有过几百页畅谈的聊天记录，街上碰见了也不打招呼的人可能曾经也乐此不疲地整天腻在一起，背地里把你骂得像狗的人可能曾经是你最好的朋友，身边人总不断更替，一段关系有时候断得悄声无息，有时候却让人措手不及，其实人都差不多，新鲜感和热情消失得很快，有新欢有旧爱。",

"昨天在宿舍临睡时我们几个在聊天，正嗨时一沉默多时的二货严肃的告诉我们说：“你想出人头地吗？你想发财致富吗？你想光宗耀祖吗？你想大富大贵吗？你想升官发财吗？请别胡思乱想了，早点睡吧！”",

" 刚才和朋友聊天，其中有谈到你，知道吗？我和他们吵了起来，还差点动手打起来，因为他们有的说你像猴子，有的说你像猩猩，实在太过分了！根本没有把你当猪看！",

" 中午休息，我和同事在一起聊天，忽然聊到了房子。我说：“现在房子这么贵，如果我有块地，那真是发达了！”他说：“你要是有块地，我马上认你做干爹！”刚说完，前台那边小姑娘喊我：“你有快递！”后来整个下午我干儿子都不愿意和我说话。",

"一次，我和朋友聊天，朋友1问“芙蓉姐姐和凤姐同时掉下海，你有一块板砖，你拍谁？” 我答：“背对他们扔，扔到谁算谁。” 朋友2说：“谁救她们我拍谁。”我心里默默想着，好吧，你赢了！！",

" 昨晚朋友生日，跟她们聊天提了你两次，虽然没什麽感觉心还是蹬了那么一下，我有时也会在想你跟她们在一起时无意听到我名字会不会也有这样的感觉。然后另外一个来接我，我们亲吻了，不紧张也不心动。我只想这样可以快点忘了你。",

" 上初中的儿子沉迷于网上聊天，今天吃饭的时候我借机提醒他：“现在网络上什么人都有，我看新闻上说，有变态基佬假装成女生和小男生聊天，儿子你可要小心一点啊。”“放心吧爸爸，我很小心，”儿子扒了一口饭说道，“我不会被那些小男生发现身份的。”",

"大学毕业三年，几个同学在班群聊天，聊的全是技术，java，xml之类。另一同学家里开厂，早早做上管理者，插不上嘴，心里很不爽，过了半天插了一句：本公司因业务拓展，招聘驾驶员一名，要求：4年java开发经验！顿时群里安静了……",

" 我不太主动找人聊天。所以，我主动找的，都是我在乎的人。明明喜欢的人，不能喜欢。明明苦等没有，还要装坚强。明明想打电话，却按到最后一个号码，按了关闭。明明一个个字的打好了，反复增增减减，生怕有一个字错了，却到最后全部按了删除。",

"谁把谁的通讯录一键删除，谁又把谁的聊天记录一键删除然后把对方号码放进黑名单。我最怕看见的，是明明相知相爱的两个人变成陌路，再也不联系也不会因为对方的名字掀起一丝波澜。其实你明知道，回忆里的人是不能去见的。去见了，回忆就没了。人都是会变的。爱情也好，友情也罢。",

"聊天时：【哈】①哈，代表附和。②哈哈，代表敷衍。③哈哈哈，代表认同。④哈哈哈哈，代表陌生。【呵】①呵，代表拘谨。②呵呵，代表装逼。③呵呵呵，代表应付。④，呵呵呵呵，代表随便。【哼】①，哼，代表调皮。②哼哼，代表可爱。③，哼哼哼，代表无聊。哼哼哼哼，代表蛋疼。",

" 刚上微信和附近一女的聊天。问我在干嘛呢，我说在做红烧牛肉。",

" 她问就我一个人在家吗，我说是的。她说那我去你家吃牛肉吧，我一听二话没说直接删了，四十多一斤的牛肉你想吃，门儿都没有！",

"试验室里聊天，一个姑娘说：“好想嫁个有钱老公。”另外一个说：“我也是。”然后我好奇插了一句：“有钱了你们想干吗？”满以为会说逛街美容买珠宝之类，没想到俩姑娘眼睛放光，兴奋地讨论起来：“有钱了就可以自由地做研究啊！”“对，想要什么试剂就让老公给买。”",

"留言板和聊天记录都不是一个可以随便翻阅的东西，在你翻阅的过程中你会发现，一些人，一些事，还有一些彼此间扣留的情感都因为时间的流逝而消失不见，最后沉淀下来的只有一道道伤痕，被现实撕裂。",

"大学毕业三年，几个同学在班群聊天，聊的全是技术，java，xml之类。另一同学家里开厂，早早做上管理者，插不上嘴，心里很不爽，过了半天插了一句：本公司因业务拓展，招聘驾驶员一名，要求：4年java开发经验！顿时群里安静了……",

"有没有试过回过头去看你跟一个人的聊天记录，从一开始到现在。看着看着就笑了，笑着笑着就哭……一个人，从陌生走近你，然后再陌生。",

"喜欢你的人，半夜会找你打电话聊天到很晚；爱你的人，半夜看你在网上会赶你下线。喜欢你的人，在你生病时，会讲好话关心你；爱你的人，在你生病时，他会关心到你烦，并强迫你去看医生。喜欢你的人，他说他要给你最大的快乐；爱你的人，他只能给你保证，你跟他在一起，他是最快乐的。",

	}
	return yuyan[math.random(1,#yuyan)]
end
















